Revit 2027 API
LineLoad.GetCurve Method
 Returns curve that define geometry of the line load.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Curve GetCurve()
Public Function GetCurve As Curve
public:
Curve^ GetCurve()
member GetCurve : unit -> Curve
Return Value
Curve
See Also
Reference
LineLoad Class
Autodesk.Revit.DB.Structure Namespace